Autodesk.Revit.DB.Structure.RebarInSystem.DoesBarExistAtPosition(System.Int32)
Checks whether a bar exists at the specified position.
Remarks:
Returns true, unless the bar position is the first or last
in the set and it is suppressed by IncludeFirstBar or IncludeLastBar.
For the current implementation of RebarInSystem, this property will always return true,
since the first and last bars in a RebarInSystem set cannot be suppressed.
However, it is included in the RebarInSystem interface for consistency with the Rebar class
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
Returns:
Always returns true, since it is not possible to de-activate the first or last bars
in a Rebar set that is part of Area or Path Reinforcement.
(see includeFirstBar and includeLastBar methods for Rebar)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.GetHookTypeId(System.Int32)
Get the id of the RebarHookType to be applied to the rebar.
end:
0 for the start hook, 1 for the end hook.
Returns:
The id of a RebarHookType, or invalidElementId if the rebar has
no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.GetBendData
Gets the RebarBendData, containing bar and hook information, of the instance.
Remarks:
Internally, the bend data is used by many RebarShape methods to generate shape geometry.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this rebar element to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if rebar element is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.RebarInSystem.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this rebar element is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if rebar is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Structure.RebarInSystem.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets  RebarInSystem element to be shown unobscured in a view.
view:
The view element
unobscured:
True if  RebarInSystem element is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.RebarInSystem.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this rebar element is shown unobscured in a view.
view:
The view element
Returns:
True if rebar is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.GetHostId
The element that contains the rebar.
Returns:
The element that the rebar object belongs to, such as a structural
wall, floor, foundation, beam, brace or column.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.CanApplyPresentationMode(Autodesk.Revit.DB.View)
Checks if a presentation mode can be applied for this rebar in the given view.
dBView:
The view in which presentation mode will be applied.
Returns:
True if a presentation mode can be applied for the given view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.ClearPresentationMode(Autodesk.Revit.DB.View)
Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
dBView:
The view where the presentation mode will be cleared. NULL for all views
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.FindMatchingPredefinedPresentationMode(Autodesk.Revit.DB.View)
Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
Remarks:
If the presentation mode is not PresentationMode.Select for the view, this function returns the current mode.
dBView:
The view.
Returns:
The presentation mode that matches the current set of selected hidden and unhidden bars.
If there is no better match, this returns RebarPresentationMode.Select.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.GetPresentationMode(Autodesk.Revit.DB.View)
Gets the presentaion mode for this rebar set when displayed in the given view.
dBView:
The view.
Returns:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode)
Sets the presentation mode for this rebar set when displayed in the given view.
dBView:
The view.
presentationMode:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.HasPresentationOverrides(Autodesk.Revit.DB.View)
Identifies if this RebarInSystem has overridden default presentation settings for the given view.
Remarks:
Default presentation settings can be overriden using Autodesk.Revit.DB.Structure.RebarInSystem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean), Autodesk.Revit.DB.Structure.RebarInSystem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode) methods
dBView:
The view.
Returns:
True if this RebarInSystem has overriden default presentation settings, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.IsRebarInSection(Autodesk.Revit.DB.View)
Identifies if this RebarInSystem is shown as a cross-section in the given view.
dBView:
The view.
Returns:
True if this RebarInSystem is shown as a cross-section, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.IsBarHidden(Autodesk.Revit.DB.View,System.Int32)
Identifies if a given bar in this rebar set is hidden in this view.
view:
The view.
barIndex:
The index of the bar from this rebar set.
Returns:
True if the bar is hidden in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the bar in this rebar set to be hidden or unhidden in the given view.
Remarks:
Individual bars of a rebar set can be hidden in a view only
if the presentation mode is RebarPresentationMode.Select.
If that is not the presentation mode assigned for this set in the view,
this method will also change it.
view:
The view.
barIndex:
The index of the bar from this set.
hide:
True to hide this bar in the view, false to unhide the bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2015

Autodesk.Revit.DB.Structure.RebarInSystem.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.RebarInSystem.GetBarPositionTransform(System.Int32)
Return a transform representing the relative position of any
individual bar in the set.
Remarks:
The transform is a translation along the distribution path.
It can be applied to the results of GetCenterlineCurves() to
produce any bar in the rebar set. For barPositionIndex=0,
the identity transform is always returned.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The position of a bar in the set relative to the first position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.GetDistributionPath
The distribution path of a rebar set.
Returns:
A line beginning at (0, 0, 0) and representing the direction and
length of the set.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean)
A chain of curves representing the centerline of the rebar.
Remarks:
If the Rebar is a set, meaning GetLayoutRule() does not return Single,
this method returns the first rebar in the set, even if the
first bar is suppressed by IncludeFirstBar being false.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.NumberOfBarPositions
The number of bar positions available in the rebar.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.RebarShapeId
The RebarShape element that defines the shape of the rebar.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.Volume
The volume of an individual bar multiplied by Quantity.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.TotalLength
The length of an individual bar multiplied by Quantity.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.LayoutRule
Identifies the layout rule of rebar set.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.MaxSpacing
Identifies the maximum spacing between rebar in rebar set.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.Quantity
Identifies the number of bars in rebar set.
For the current implementation of RebarInSystem, this property will always return the same number as NumberOfBarPositions,
since the first and last bars of a RebarInSystem set cannot be suppressed.
However, it is included in the RebarInSystem interface for consistency with the Rebar class.
Remarks:
Quantity is equal to NumberOfBarPositions if IncludeFirstBar and IncludeLastBar are set.
If any end bars are excluded, they are not counted in the Quantity.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.ArrayLength
Identifies the distribution path length of rebar set.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.BarsOnNormalSide
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
For the current implementation of RebarInSystem, this property will always return true,
but it is included in the RebarInSystem interface for consistency with the Rebar class.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.Normal
A unit-length vector normal to the plane of the rebar
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.ScheduleMark
The Schedule Mark parameter. On creation, the Schedule Mark is set
to a value that is unique to the host, but it can be set to
any value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem.SystemId
The Id of an AreaReinforcement or PathReinforcement element that owns
this element.
Since:
2013

Autodesk.Revit.DB.Structure.RebarInSystem
Represents a rebar element that is part of a system.
Remarks:
A RebarInSystem element is part of another element, the "system",
which controls most of its properties. The system elements
are AreaReinforcement and PathReinforcement.
Only a few properties of RebarInSystem
are modifiable. Otherwise, the appearance and behavior of RebarInSystem
elements is identical to Rebar elements. RebarInSystem elements may be
converted to Rebar elements by removing the system element.
Since:
2013